type DeclensionType = {
  [key: string]: {
    from: string; // Склонение для "из города"
    to: string; // Склонение для "в страну"
  };
};

const cityDeclensions: DeclensionType = {
  Бишкек: {
    from: "Бишкека",
    to: "Бишкек",
  },
  Алматы: {
    from: "Алматы",
    to: "Алматы",
  },
  Ташкент: {
    from: "Ташкента",
    to: "Ташкент",
  },
  // Добавьте другие города по необходимости
};

const countryDeclensions: DeclensionType = {
  Абхазия: { from: "Абхазии", to: "Абхазию" },
  Азербайджан: { from: "Азербайджана", to: "Азербайджан" },
  Албания: { from: "Албании", to: "Албанию" },
  Бахрейн: { from: "Бахрейна", to: "Бахрейн" },
  Беларусь: { from: "Беларуси", to: "Беларусь" },
  Венгрия: { from: "Венгрии", to: "Венгрию" },
  Вьетнам: { from: "Вьетнама", to: "Вьетнам" },
  Германия: { from: "Германии", to: "Германию" },
  Греция: { from: "Греции", to: "Грецию" },
  Грузия: { from: "Грузии", to: "Грузию" },
  Доминикана: { from: "Доминиканы", to: "Доминикану" },
  Египет: { from: "Египта", to: "Египет" },
  Индия: { from: "Индии", to: "Индию" },
  Индонезия: { from: "Индонезии", to: "Индонезию" },
  Испания: { from: "Испании", to: "Испанию" },
  Италия: { from: "Италии", to: "Италию" },
  Казахстан: { from: "Казахстана", to: "Казахстан" },
  Катар: { from: "Катара", to: "Катар" },
  Кения: { from: "Кении", to: "Кению" },
  Кипр: { from: "Кипра", to: "Кипр" },
  Китай: { from: "Китая", to: "Китай" },
  Маврикий: { from: "Маврикия", to: "Маврикий" },
  Малайзия: { from: "Малайзии", to: "Малайзию" },
  Мальдивы: { from: "Мальдив", to: "Мальдивы" },
  Марокко: { from: "Марокко", to: "Марокко" },
  ОАЭ: { from: "ОАЭ", to: "ОАЭ" },
  Оман: { from: "Омана", to: "Оман" },
  Португалия: { from: "Португалии", to: "Португалию" },
  Россия: { from: "России", to: "Россию" },
  Сейшелы: { from: "Сейшел", to: "Сейшелы" },
  Сингапур: { from: "Сингапура", to: "Сингапур" },
  Словения: { from: "Словении", to: "Словению" },
  Таиланд: { from: "Таиланда", to: "Таиланд" },
  Танзания: { from: "Танзании", to: "Танзанию" },
  Турция: { from: "Турции", to: "Турцию" },
  Франция: { from: "Франции", to: "Францию" },
  Черногория: { from: "Черногории", to: "Черногорию" },
  Чехия: { from: "Чехии", to: "Чехию" },
  "Шри-Ланка": { from: "Шри-Ланки", to: "Шри-Ланку" },
  "Южная Корея": { from: "Южной Кореи", to: "Южную Корею" },
  Япония: { from: "Японии", to: "Японию" },
};

export function getCityDeclension(
  cityName: string,
  type: "from" | "to"
): string {
  return cityDeclensions[cityName]?.[type] || cityName;
}

export function getCountryDeclension(
  countryName: string,
  type: "from" | "to"
): string {
  return countryDeclensions[countryName]?.[type] || countryName;
}
